УРВ_файловая/src/InformationRegisters/ФактическиеТрудозатраты/ФактическиеТрудозатраты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ФактическиеТрудозатраты</name>
  <resources>
    <name>Длительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ОписаниеРаботы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОбслуживающаяОрганизация</name>
    <type>
      <types>CatalogRef.ОбслуживающиеОрганизации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЛинияПоддержки</name>
    <type>
      <types>CatalogRef.ЛинииПоддержки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Источник</name>
    <type>
      <types>CatalogRef.Пожелания</types>
      <types>CatalogRef.Консультации</types>
      <types>DocumentRef.Обращение</types>
      <types>CatalogRef.Ошибки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРаботы</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерДобавления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Работа</name>
    <type>
      <types>CatalogRef.Работы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УРВ_файловая/src/InformationRegisters/СведенияОПользователях/СведенияОПользователях.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СведенияОПользователях</name>
  <resources>
    <name>ОбслуживающаяОрганизация</name>
    <type>
      <types>CatalogRef.ОбслуживающиеОрганизации</types>
    </type>
  </resources>
  <resources>
    <name>ЛинияПоддержки</name>
    <type>
      <types>CatalogRef.ЛинииПоддержки</types>
    </type>
  </resources>
  <resources>
    <name>ПотребоватьСменуПароляПриВходе</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СрокДействияНеОграничен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СрокДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПросрочкаРаботыВПрограммеДоЗапрещенияВхода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаРазрешенияВходаВПрограмму</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаПоследнейАктивности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаАвтоматическогоЗапрещенияВхода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаИспользованияПароля</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИспользованныеПароли</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>ПоследнийИспользуемыйКлиент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УРВ_файловая/src/InformationRegisters/ФактическиеТрудозатраты/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы
    
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоНовый = Параметры.Ключ.Пустой();
	
	Если ЭтоНовый Тогда 
		//Люфт Кристина Задача №87997 03.07.2019 +
		//Запись.ДатаРаботы = ТекущаяДатаСеанса();
		//Запись.Пользователь = Пользователи.АвторизованныйПользователь();
		//
		//СведенияОПользователе = РегистрыСведений.СведенияОПользователях.СведенияОПользователе(Запись.Пользователь);
		//
		//Запись.ОбслуживающаяОрганизация = СведенияОПользователе.ОбслуживающаяОрганизация;
		//Запись.ЛинияПоддержки = СведенияОПользователе.ЛинияПоддержки;
		//Люфт Кристина Задача №87997 03.07.2019 -
		Если Параметры.Свойство("Источник") И ЗначениеЗаполнено(Параметры.Источник) Тогда 
			Запись.Источник = Параметры.Источник;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Запись.Источник) Тогда 
			Запись.ОписаниеРаботы = СтрШаблон(НСтр("ru = 'Работа над ""%1""'"), Запись.Источник);
			//Люфт Кристина Задача №87997 03.07.2019 +
			Запись.ДатаРаботы = ТекущаяДатаСеанса();
			Запись.Пользователь = Пользователи.АвторизованныйПользователь();
		
			СведенияОПользователе = РегистрыСведений.СведенияОПользователях.СведенияОПользователе(Запись.Пользователь);
		
			Запись.ОбслуживающаяОрганизация = СведенияОПользователе.ОбслуживающаяОрганизация;
			Запись.ЛинияПоддержки = СведенияОПользователе.ЛинияПоддержки;
			
		Иначе 		
			Сообщить("Документ не записан.
			|Указать трудозатраты можно только после записи документа.");
			Отказ = Истина;
			//Люфт Кристина Задача №87997 03.07.2019 -
		КонецЕсли;
		
	КонецЕсли;
	
	ДлительностьРаботы = УчетВремениКлиентСервер.ЧислоВСтроку(Запись.Длительность);
	
	Элементы.Пользователь.ТолькоПросмотр = Истина;
	Если РольДоступна("ПолныеПрава") Тогда 
		Элементы.Пользователь.ТолькоПросмотр = Ложь;
	КонецЕсли;
	
	НачальнаяДатаДобавления = Запись.ДатаРаботы;
	
	Элементы.ДлительностьРаботы.СписокВыбора.ЗагрузитьЗначения(МассивВыбораВремени());
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.Длительность = УчетВремениКлиентСервер.ЧислоИзСтроки(ДлительностьРаботы);
	
	Если ЭтоНовый Или НачальнаяДатаДобавления <> ТекущийОбъект.ДатаРаботы Тогда 
		ТекущийОбъект.НомерДобавления = УчетВремени.МаксимальныйНомерДобавления(
			ТекущийОбъект.ОбслуживающаяОрганизация, 
			ТекущийОбъект.ЛинияПоддержки, 
			ТекущийОбъект.Пользователь, 
			ТекущийОбъект.ДатаРаботы);
	КонецЕсли;		
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	НачальнаяДатаДобавления = Запись.ДатаРаботы;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ЗначениеЗаполнено(ДлительностьРаботы) Или ДлительностьРаботы = "00:00" Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Не заполнено поле ""Длительность""'"),,
			"ДлительностьРаботы",, 
			Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции
    
&НаКлиентеНаСервереБезКонтекста
Функция МассивВыбораВремени()
	
	МассивВыбора = Новый Массив;
	
	МассивВыбора.Добавить("00:15");
	МассивВыбора.Добавить("00:30");
	МассивВыбора.Добавить("00:45");
	МассивВыбора.Добавить("01:00");
	МассивВыбора.Добавить("01:30");
	МассивВыбора.Добавить("02:00");
	МассивВыбора.Добавить("03:00");
	МассивВыбора.Добавить("04:00");
	МассивВыбора.Добавить("05:00");
	
	Возврат МассивВыбора;
	
КонецФункции

#КонецОбласти
